import React from 'react';

const PrivacyPolicyPage = () => {
  return (
    <div className="container">
      <h1 className="section-title">Политика конфиденциальности</h1>
      <p>Дата вступления в силу: [Дата]</p>

      <h2>1. Введение</h2>
      <p>
        Добро пожаловать в [Название вашей компании] ("мы", "наш", "нас"). Мы
        ценим вашу конфиденциальность и стремимся защищать вашу личную
        информацию. Настоящая Политика конфиденциальности объясняет, как мы
        собираем, используем, раскрываем и защищаем вашу информацию, когда вы
        посещаете наш веб-сайт [URL вашего веб-сайта] (далее - "Сайт").
        Пожалуйста, внимательно ознакомьтесь с этой Политикой
        конфиденциальности. Если вы не согласны с условиями настоящей политики
        конфиденциальности, пожалуйста, не используйте Сайт.
      </p>

      <h2>2. Сбор вашей информации</h2>
      <p>
        Мы можем собирать информацию о вас различными способами. Информация,
        которую мы можем собирать на Сайте, включает:
      </p>
      <h3>Личные данные</h3>
      <p>
        Лично идентифицируемая информация, такая как ваше имя, адрес
        электронной почты и номер телефона, которую вы добровольно предоставляете
        нам [при регистрации на Сайте или] когда вы решите участвовать в
        различных действиях, связанных с Сайтом, таких как онлайн-чат и доски
        объявлений.
      </p>

      <h2>3. Использование вашей информации</h2>
      <p>
        Мы используем собранную о вас информацию для следующих целей:
        <ul>
          <li>Для предоставления и поддержки наших услуг.</li>
          <li>Для улучшения нашего Сайта и услуг.</li>
          <li>Для ответа на ваши запросы и комментарии.</li>
          <li>Для отправки вам маркетинговых и рекламных материалов.</li>
        </ul>
      </p>

      <h2>4. Раскрытие вашей информации</h2>
      <p>
        Мы не будем передавать вашу личную информацию третьим лицам без вашего
        согласия, за исключением случаев, предусмотренных законом.
      </p>

      <h2>5. Безопасность вашей информации</h2>
      <p>
        Мы используем административные, технические и физические меры
        безопасности для защиты вашей личной информации. Хотя мы приняли
        разумные меры для защиты личной информации, которую вы нам
        предоставляете, имейте в виду, что никакие меры безопасности не являются
        идеальными или непроницаемыми, и никакой метод передачи данных не может
        быть гарантирован от любого перехвата или другого вида неправомерного
-        использования.
      </p>

      <h2>6. Контактная информация</h2>
      <p>
        Если у вас есть вопросы или комментарии по поводу настоящей Политики
        конфиденциальности, пожалуйста, свяжитесь с нами:
        <ul>
          <li>По электронной почте: [адрес электронной почты]</li>
          <li>По телефону: [номер телефона]</li>
        </ul>
      </p>
    </div>
  );
};

export default PrivacyPolicyPage;
